Revit 2018 API
PipeSettings.GetPressLossCalculationServerInfo Method
 Get the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in the next version of Revit. Custom pipe pressure loss calculations will no longer be supported.")]
public MEPCalculationServerInfo GetPressLossCalculationServerInfo()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in the next version of Revit. Custom pipe pressure loss calculations will no longer be supported.")> _
Public Function GetPressLossCalculationServerInfo As MEPCalculationServerInfo
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2018 and will be removed in the next version of Revit. Custom pipe pressure loss calculations will no longer be supported.")]
public:
MEPCalculationServerInfo^ GetPressLossCalculationServerInfo()
Return Value
 The MEPServerInfo of the current pipe pressure loss calculation server
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace